MongoDB/Workload C/Output_Test1_LOAD.txt
java -cp /home/ubuntu/ycsb-0.17.0/mongodb-binding/conf:/home/ubuntu/ycsb-0.17.0/conf:/home/ubuntu/ycsb-0.17.0/lib/HdrHistogram-2.1.4.jar:/home/ubuntu/ycsb-0.17.0/lib/htrace-core4-4.1.0-incubating.jar:/home/ubuntu/ycsb-0.17.0/lib/jackson-mapper-asl-1.9.4.jar:/home/ubuntu/ycsb-0.17.0/lib/jackson-core-asl-1.9.4.jar:/home/ubuntu/ycsb-0.17.0/lib/core-0.17.0.jar:/home/ubuntu/ycsb-0.17.0/mongodb-binding/lib/mongodb-async-driver-2.0.1.jar:/home/ubuntu/ycsb-0.17.0/mongodb-binding/lib/mongo-java-driver-3.8.0.jar:/home/ubuntu/ycsb-0.17.0/mongodb-binding/lib/slf4j-api-1.7.25.jar:/home/ubuntu/ycsb-0.17.0/mongodb-binding/lib/snappy-java-1.1.7.1.jar:/home/ubuntu/ycsb-0.17.0/mongodb-binding/lib/mongodb-binding-0.17.0.jar:/home/ubuntu/ycsb-0.17.0/mongodb-binding/lib/logback-classic-1.1.2.jar:/home/ubuntu/ycsb-0.17.0/mongodb-binding/lib/logback-core-1.1.2.jar site.ycsb.Client -db site.ycsb.db.MongoDbClient -s -P workloads/workloadc -p recordcount=1000 -p mongodb.upsert=true -p mongodb.url=mongodb://primary:27017,secondary1:27017,secondary2:27017,secondary3:27017/?replicaSet=myReplicaSet -load
Command line: -db site.ycsb.db.MongoDbClient -s -P workloads/workloadc -p recordcount=1000 -p mongodb.upsert=true -p mongodb.url=mongodb://primary:27017,secondary1:27017,secondary2:27017,secondary3:27017/?replicaSet=myReplicaSet -load
YCSB Client 0.17.0

Loading workload...
Starting test.
2023-04-09 19:35:42:646 0 sec: 0 operations; est completion in 0 second
mongo client connection created with mongodb://primary:27017,secondary1:27017,secondary2:27017,secondary3:27017/?replicaSet=myReplicaSet
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
2023-04-09 19:35:49:647 7 sec: 1000 operations; 140.85 current ops/sec; [CLEANUP: Count=1, Max=6967, Min=6964, Avg=6966, 90=6967, 99=6967, 99.9=6967, 99.99=6967] [INSERT: Count=1000, Max=141183, Min=3552, Avg=6393.39, 90=8035, 99=14359, 99.9=25215, 99.99=141183]
[OVERALL], RunTime(ms), 7102
[OVERALL], Throughput(ops/sec), 140.80540692762602
[TOTAL_GCS_G1_Young_Generation], Count, 4
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 34
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.47873838355392845
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 4
[TOTAL_GC_TIME], Time(ms), 34
[TOTAL_GC_TIME_%], Time(%), 0.47873838355392845
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 6966.0
[CLEANUP], MinLatency(us), 6964
[CLEANUP], MaxLatency(us), 6967
[CLEANUP], 95thPercentileLatency(us), 6967
[CLEANUP], 99thPercentileLatency(us), 6967
[INSERT], Operations, 1000
[INSERT], AverageLatency(us), 6393.385
[INSERT], MinLatency(us), 3552
[INSERT], MaxLatency(us), 141183
[INSERT], 95thPercentileLatency(us), 10431
[INSERT], 99thPercentileLatency(us), 14359
[INSERT], Return=OK, 1000